import time
import pygame
#import sys

pygame.init()
# ========================================================================================================================
# ایجاد پنجره در بازی 
win = pygame.display.set_mode((800,550)) # درون تاپل پارامتر باید اندازه ی پنجره ای که قراره برامون باز کنه رو مشخص میکنیم دو مقدار دریافت میکنه x , y
# ابعاد (x,y) , y میشه ستون , x میشه سطر 

# به این شکل هم نوشته میشه 
# tup = (400,300)
# win = pygame.display.set_mode(tup)
# ==========================================================================================================================
# برای مشخص کردن نام پنجره که در بلاب پنجره این نام ظاهر میشه 
pygame.display.set_caption("Danial")
# =============================================================================================================================
# حالا میخوایم رنگ پس زمینه یا همون بکگراند صفحه رو عوض کنیم
# # color = (R,G,B) # R = red : 255 , G = green : 255 , B = Blue : 255 
# win.fill((0,255,0)) # در اینجا رنگ بکگراند یا پس زمینه رو تعیین میکنیم 
# pygame.display.flip() # وقتی که کارمون با پس زمینه تموم شد یا رنگ بکگراند رو عوض کردیم این کد رو اجرا میکنیم که نتیجه کار رو بهمون خروجی کنه 
# ===========================================================================================================================
# time.sleep(3) # برای این که صفحه زود بسته نشه از ماژول تایم استفاده کردم تا دیر تر صفحه بسته بشه یعنی سه ثانیه دیر تر صفحه بسته میشه 
# ===========================================================================================================================
# برای دیدن این که چه اتفاقی داره رو صفحه میفته یا به اصطلاح صفحه چه ورودی هایی دریافت میکنه از این روش استفاده میکنیم 
# برای مشاهده بهتر داخل حلقه بی نهایت قرار میدیم
# while True:
#     for event in pygame.event.get():
#         print(event)
# =======================================================================================================================================
# نمیتونید پنجره رو ببندید درسته؟ ما روشی داریم که کمک میکنه تا بتونید پنجره رو ببندید 
# روش های مختلفی براش وجود دارد بهترین روش همون چیزی هست که از کامنت خارجش کردم
# run = True
# while run :
#     for event in pygame.event.get():
#         if  event.type == pygame.QUIT:
#             run = False
##  :میتونید ادامش هرکدوم از این هارو قرار بدید اگرم نداید عیب نداره ولی باعث بسته شدن یا متوقف شدن میشه 
## pygame.quit() 
## sys.exit()
## exit()


# while True:
#     for event in pygame.event.get():
#         if  event.type == pygame.QUIT:
#             exit() # بهترین روش این است چون با ارور مواجه نمیشید و راحت تر برنامه بسته میشه 
            #pygame.quit() # این روش خوب است ولی بعد از بستن پنجره با ارور مواجه میشید
            # sys.exit() # این روش هم خوب است با بستن پنجره با ارور ماجه نمیشید ولی باید حتما قبلش ماژول sys رو import کنید 
# ===================================================================================================================================
# به یاد داشته باشید که مقدار (0,0) میشه گوشه سمت بالا 
# حالا نحوه ی رسم شکل در صفحه رو میپردازیم
# color = (R,G,B) # R = red : 255 , G = green : 255 , B = Blue : 255 
# draw : برای رسم شکل هست , rect : هم نوع شکل رو میگه که مستطیله واسه مثلث و دایره هم بعدا میگیم 
# خب حالا تک تک ارگومان هاشو میخوایم توضیح بدیم:
# ارگومان اول بایدصفحه رو براش مشخص کنیم 
# ارکومان دوم باید رنگ شکل رو مشخص کنیم 
#ارگومان سوم مختصاد شکل رو مشخص میکنیم
# و همینطور اندازه ی شکل رو مشخص میکنیم 
# ارگومان چهارم اختیاریه ضخامت شکل رو میشخص میکنیم 

# pygame.draw.rect(win,(255,0,0),((300,300),(100,50)),1)
# pygame.display.update()

###################
# بریم سراغ کشیدن دایره 
# draw : برای رسم شکل هست , rect : هم نوع شکل رو میگه که مستطیله واسه مثلث و دایره هم بعدا میگیم 
# خب حالا تک تک ارگومان هاشو میخوایم توضیح بدیم:
# ارگومان اول بایدصفحه رو براش مشخص کنیم 
# ارکومان دوم باید رنگ شکل رو مشخص کنیم 
#ارگومان سوم مختصاد شکل رو مشخص میکنیم
# و همینطور اندازه ی شعاع شکل رو مشخص میکنیم 
# ارگومان چهارم اختیاریه ضخامت شکل رو میشخص میکنیم اگر مشخص نکنیم شکل تو پر میشه

# pygame.draw.circle(win,(0,255,0),(300,250),20)
# pygame.display.update() # کارش ایجاد کردن شکل هست و لزومی نداره چند بار بعد از مشخصات هر شکل رونو بیاریم 

##################
# فقط بعد از این که تمام شکل هارو مشخص کردیم اونو میاریم به این شکل 

# pygame.draw.rect(win,(255,0,0),((300,300),(100,50)),1) # مستطیل
# pygame.draw.circle(win,(0,255,0),(300,250),20) # دایره
# pygame.display.update() # یک بار بیاریم برای همه شکل ها صدق میکند 

##################
# برای این که همیشه در حال اجرا باشه باید داخل حلقه بی نهایت قرار بدید 

# while True:
#     pygame.draw.rect(win,(255,0,0),((300,300),(100,50)),1) # مستطیل 
#     pygame.draw.circle(win,(0,255,0),(300,250),20) # دایره
#     pygame.display.update()

##################
# و اگرم کدتون قابلیت بستن برنامه هم داشت باید این دو خط خارج از حلقه ی for قرار بدید
# while True:
#     for event in pygame.event.get():
#         if  event.type == pygame.QUIT:
#             exit() 
#     pygame.draw.rect(win,(255,0,0),((300,300),(100,50)),1) # مشخصات شکل مستطیل 
#     pygame.draw.circle(win,(0,255,0),(300,250),20,1) # مشخصات شکل دایره دایره 
#     pygame.display.update() # ایجاد شکل 

# =============================================================================================================
# در این اموزش کار با فونت ها رو نوشته ها کار میکنیم
# برای نمایش تمام فونت هایی که در سیستم عامل داریم از این روش استفاده میکنیم
# fonts = pygame.font.get_fonts()
# for f in fonts:
#     print(f)

#####################
# خب حالا میخوایم با فونت یک نوشته در صفحه به وجود بیاریم 
# در این روش بهتر هست که فونت هایی که درون سیستم وجود داره یا نصب هستش رو به عنوان ارگومان بدیم
# font = pygame.font.SysFont()

#####################
# ولی در اینجا شما میتونید از فونت های خارجی یا فونت هایی که نصب نیست در سیستم هم استفاده کنید و به عنوان ارگومان بهش بدید
# font = pygame.font.Font() 

######################
# خط اول فونتمون رو مشخص میکنیم
# در خط دوم کاری که قراره با فونت انجام بدیم رو مشخص میکنیم 
# خط سوم مختصات نوشته رو مشخص میکنیم 
# خط چهارم هم کار رو تموم میکنیم
# font = pygame.font.Font(None,100) # در ارگومان اول نوع فونت رو مشخص میکنیم اگر فونت نداشتیم همون چیزی که نوشتم رو قرار میدیم تا به صورت پیشفرض استفاده کنه و در ارگومان دوم سایز فونت رو قرار میدیم
# T_S = font.render("Game",True,(0,0,255)) # ارگومان اول نوشته ای که قراره رو صفحه نمایش داده بشه رو قرار میدیم ارگومان دوم با مقدار درست و غلط مشخص میکنیم که نوشته دارای لبه نباشه یا نه ارگومان سوم ارگومان سوم رنگ نوشته رو مشخص میکنیم 
# win.blit(T_S,(400,300)) # در اینجا مختصات نوشته رو مشخص میکنیم
# pygame.display.update() # اینم که برای پایان کار با اشکال ها و نوشته هاست و باید باشه 

# ===============================================================================================================
# حالا اشکال هارو به حرکت در میاریم 
# x_rect = 0
# y_rect = 500
# speed = 1

# while True:
#     for event in pygame.event.get():
#         if  event.type == pygame.QUIT: # شرط خروج 
#             exit() # خروج
#     win.fill((0,255,0)) # رنگ صفحه
#     #pygame.display.flip() # ایجاد رنگ صفحه
#     pygame.draw.rect(win,(255,0,255),((x_rect,y_rect),(100,50))) # مشخصات شکل مستطیل 
#     #pygame.draw.circle(win,(0,255,0),(300,250),20,1) # مشخصات شکل دایره دایره 
#     if (x_rect >= 0) and (y_rect == 500): # شزط حرکت
#         x_rect += speed
#     if (y_rect <= 500) and (x_rect == 700): # شرط حرکت
#         y_rect -= speed
#     if (x_rect <= 700) and (y_rect == 0) : # شرط حرکت
#         x_rect -= speed
#     if (y_rect >= 0 ) and (x_rect == 0) : # شرط حرکت
#         y_rect += speed
#     pygame.display.update() # ایجاد شکل
